example.org
#+HTML_HEAD: <link rel="stylesheet" href="http://xieyuheng.github.io/asset/css/page.css" type="text/css" media="screen" />
#+PROPERTY: tangle example.scm
#+title: example code of sequent1

---------

- simple example code ([[https://github.com/xieyuheng/sequent1][source]])

---------

* note

  - part of the examples are learned from [[http://www.cs.cmu.edu/~drl/teaching/oplss13/][a course about agda]] at [[https://www.cs.uoregon.edu/research/summerschool/summer13/curriculum.html][OPLSS 2013]]
    part of them are learned the little schemer

* natural

  #+begin_src scheme
  (eva

   (deftype natural (-> type)
     zero (-> natural)
     succ (natural -> natural))

   (defn add (natural natural -> natural)
     (:m zero -> :m)
     (:m :n succ -> :m :n add succ))

   (defn mul (natural natural -> natural)
     (:m zero -> zero)
     (:m :n succ -> :m :n mul :m add))

   (app (->
         zero succ
         zero succ succ
         add))

   (app (->
         zero succ succ
         zero succ succ
         mul)))
  #+end_src

* list

  #+begin_src scheme
  (eva

   (deftype natural (-> type)
     zero (-> natural)
     succ (natural -> natural))

   (defn add (natural natural -> natural)
     (:m zero -> :m)
     (:m :n succ -> :m :n add succ))

   (defn mul (natural natural -> natural)
     (:m zero -> zero)
     (:m :n succ -> :m :n mul :m add))

   (deftype list ((:t : type) :t -> type)
     null (-> :t list)
     cons (:t list :t -> :t list))

   (defn append (:t list :t list -> :t list)
     (:l null -> :l)
     (:l :r :e cons -> :l :r append :e cons))

   (app (->
         null
         zero cons
         null
         zero cons
         append))

   (app (->
         null
         zero cons
         zero cons
         null
         zero cons
         zero cons
         append)))
  #+end_src

