example.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-05-15 Sun 18:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>example code of sequent1</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="XIE Yuheng" />
<link rel="stylesheet" href="http://xieyuheng.github.io/asset/css/page.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
喪以不執 所執者喪 執喪相比 方死方生
</div>
<div id="content">
<h1 class="title">example code of sequent1</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8b61ad5"><span class="todo note">note</span> </a></li>
<li><a href="#org70e5443">natural</a></li>
<li><a href="#org8d05cb0">list</a></li>
<li><a href="#org85d3345">list map</a></li>
<li><a href="#orgc269fe2">vector</a></li>
<li><a href="#orgc471c58">vector map</a></li>
<li><a href="#orgffc31ea">swap</a></li>
</ul>
</div>
</div>
<hr  />

<ul class="org-ul">
<li><p>simple example code (<a href="https://github.com/xieyuheng/sequent1">source</a>)</p></li></ul>

<hr  />

<div id="outline-container-org8b61ad5" class="outline-2">
<h2 id="org8b61ad5"><span class="todo note">note</span> </h2>
<div class="outline-text-2" id="text-org8b61ad5">
<ul class="org-ul">
<li><p>part of the examples are learned from <a href="http://www.cs.cmu.edu/~drl/teaching/oplss13/">a course about agda</a> at <a href="https://www.cs.uoregon.edu/research/summerschool/summer13/curriculum.html">OPLSS 2013</a></p><p>part of them are learned the little schemer</p></li></ul>
</div>
</div>
